In [1]:
# Importing all Required Packages

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import ttest_ind as ttest
import os
%matplotlib inline

In [2]:
# Reading the Data set

data = pd.read_csv('StatisticalTest_Data.csv')
data.head()

,Name,Maths,Physics,Chemistry,Biology,ComputerScience,Bengali,English,History,Geography,Statistics,Gender
0,Aniket,37,34,24,15,48,45,15,45,45,45,M
1,Aarav,32,34,48,25,14,45,14,12,12,12,M
2,Aashi,32,34,45,40,15,23,45,46,13,46,F
3,Aayush,35,31,25,41,25,12,12,48,46,12,M
4,Aditi,26,33,45,39,48,47,14,23,48,48,F

In [4]:
# Creating two different data sets from the dataframe data
# datamale contains the scores for male candidates
# datafemale contains the scores for female candidates

datamale = data[data['Gender'] == 'M']
datafemale = data[data['Gender'] == 'F']

### Checking the datamle data frame

In [5]:
# First Few Rows
datamale.head()

,Name,Maths,Physics,Chemistry,Biology,ComputerScience,Bengali,English,History,Geography,Statistics,Gender
0,Aniket,37,34,24,15,48,45,15,45,45,45,M
1,Aarav,32,34,48,25,14,45,14,12,12,12,M
3,Aayush,35,31,25,41,25,12,12,48,46,12,M
5,Advait,30,27,47,5,47,14,25,28,25,6,M
6,Akshay,33,28,33,12,15,21,45,23,21,34,M

In [6]:
# Shape of the datamale dataframe
print('Number of Columns:', datamale.shape[1])
print('Number of Rows:', datamale.shape[0])

Number of Columns: 12
Number of Rows: 30

### Checking the datafemale column

In [7]:
# First Few Rows of datafemale dataframe
datafemale.head()

,Name,Maths,Physics,Chemistry,Biology,ComputerScience,Bengali,English,History,Geography,Statistics,Gender
2,Aashi,32,34,45,40,15,23,45,46,13,46,F
4,Aditi,26,33,45,39,48,47,14,23,48,48,F
7,Alisha,36,31,31,45,26,5,12,29,36,36,F
9,Amrita,40,36,5,20,25,31,32,12,45,39,F
10,Ananya,35,38,43,23,45,23,24,18,6,12,F

In [8]:
# Shape of datafemale
print('Number of Columns:', datafemale.shape[1])
print('Number of Rows:', datafemale.shape[0])

Number of Columns: 12
Number of Rows: 30

### Extracting Marks of Different Subjects for Different data frames

In [9]:
# Extracting Marks for Male Candidates

mathmale = datamale['Maths']
phymale = datamale['Physics']
chemmale = datamale['Chemistry']
biomale = datamale['Biology']
csmale = datamale['ComputerScience']

# Extracting Marks for Female Candidates
mathfemale = datafemale['Maths']
phyfemale = datafemale['Physics']
chemfemale = datafemale['Chemistry']
biofemale = datafemale['Biology']
csfemale = datafemale['ComputerScience']

## Applying T test on the two groups

* Group-1: Male Candidates
* Group-2: Female Candidates

### T Test and Its Elements

* Null Hypothesis: There is no significant difference between the two group means
* Alternative Hypothesis: There is significant Difference between the two group means

#### We reject the Null Hypothesis if the P-value is less or equal to the significance level, which is 0.05

#### Applying T Test on The Two Groups Maths Score

In [11]:
# Conducting T Test
t_statistic, p_value = ttest(mathmale , mathfemale)
print("t-statistic:", t_statistic)
print("p-value:", p_value)

# Status of the Test
if p_value <= 0.05:
    print('There is Significant Difference between Two Group Means')
else:
    print('There is no Significant Difference Between the Two group Means')

t-statistic: -0.5258861962351994
p-value: 0.6009723356710608
There is no Significant Difference Between the Two group Means

#### Applying T Test on The Physics Score

In [12]:
# Conducting T Test
t_statistic, p_value = ttest(phymale , phyfemale)
print("t-statistic:", t_statistic)
print("p-value:", p_value)

# Status of the Test
if p_value <= 0.05:
    print('There is Significant Difference between Two Group Means')
else:
    print('There is no Significant Difference Between the Two group Means')

t-statistic: 1.2172445522856656
p-value: 0.22844077427411352
There is no Significant Difference Between the Two group Means

#### Applying T Test on the Chemistry Score

In [13]:
# Conducting T Test
t_statistic, p_value = ttest(chemmale , chemfemale)
print("t-statistic:", t_statistic)
print("p-value:", p_value)

# Status of the Test
if p_value <= 0.05:
    print('There is Significant Difference between Two Group Means')
else:
    print('There is no Significant Difference Between the Two group Means')

t-statistic: 0.9727025131385346
p-value: 0.3347404945124298
There is no Significant Difference Between the Two group Means

#### Applying T Test on Biology Data

In [14]:
# Conducting T Test
t_statistic, p_value = ttest(biomale , biofemale)
print("t-statistic:", t_statistic)
print("p-value:", p_value)

# Status of the Test
if p_value <= 0.05:
    print('There is Significant Difference between Two Group Means')
else:
    print('There is no Significant Difference Between the Two group Means')

t-statistic: -0.6618695691130347
p-value: 0.5106760185365216
There is no Significant Difference Between the Two group Means

#### Applying T Test on ComputerScience Score

In [15]:
# Conducting T Test
t_statistic, p_value = ttest(csmale , csfemale)
print("t-statistic:", t_statistic)
print("p-value:", p_value)

# Status of the Test
if p_value <= 0.05:
    print('There is Significant Difference between Two Group Means')
else:
    print('There is no Significant Difference Between the Two group Means')

t-statistic: 0.3898569200121765
p-value: 0.6980703348540764
There is no Significant Difference Between the Two group Means

### Tabulating The Results for Each Subject

In [17]:
# For Maths Score

reportmath = {'Gr1':['Male'], 'Gr2':['Female'], 'Gr1_Mean':[np.mean(mathmale)], 'Gr2_Mean':[np.mean(mathfemale)],
             'Critical_Value':[0.05], 'P_value':[0.6], 'Status':['No Difference in Means']}
reportmath = pd.DataFrame(reportmath)
reportmath.index = ['Mathematics']
reportmath

,Gr1,Gr2,Gr1_Mean,Gr2_Mean,Critical_Value,P_value,Status
Mathematics,Male,Female,32.866667,33.266667,0.05,0.6,No Difference in Means

In [18]:
# For Physics Score

reportphy = {'Gr1':['Male'], 'Gr2':['Female'], 'Gr1_Mean':[np.mean(phymale)], 'Gr2_Mean':[np.mean(phyfemale)],
             'Critical_Value':[0.05], 'P_value':[0.228], 'Status':['No Difference in Means']}
reportphy = pd.DataFrame(reportphy)
reportphy.index = ['Physics']
reportphy

,Gr1,Gr2,Gr1_Mean,Gr2_Mean,Critical_Value,P_value,Status
Physics,Male,Female,33.333333,32.3,0.05,0.228,No Difference in Means

In [19]:
# For Chemistry Score

reportchem = {'Gr1':['Male'], 'Gr2':['Female'], 'Gr1_Mean':[np.mean(chemmale)], 'Gr2_Mean':[np.mean(chemfemale)],
             'Critical_Value':[0.05], 'P_value':[0.334], 'Status':['No Difference in Means']}
reportchem = pd.DataFrame(reportchem)
reportchem.index = ['Chemistry']
reportchem

,Gr1,Gr2,Gr1_Mean,Gr2_Mean,Critical_Value,P_value,Status
Chemistry,Male,Female,32.6,29.566667,0.05,0.334,No Difference in Means

In [20]:
# For Biology Score

reportbio = {'Gr1':['Male'], 'Gr2':['Female'], 'Gr1_Mean':[np.mean(biomale)], 'Gr2_Mean':[np.mean(biofemale)],
             'Critical_Value':[0.05], 'P_value':[0.51], 'Status':['No Difference in Means']}
reportbio = pd.DataFrame(reportbio)
reportbio.index = ['Biology']
reportbio

,Gr1,Gr2,Gr1_Mean,Gr2_Mean,Critical_Value,P_value,Status
Biology,Male,Female,28.466667,30.666667,0.05,0.51,No Difference in Means

In [21]:
# For ComputerScience Score

reportcs = {'Gr1':['Male'], 'Gr2':['Female'], 'Gr1_Mean':[np.mean(csmale)], 'Gr2_Mean':[np.mean(csfemale)],
             'Critical_Value':[0.05], 'P_value':[0.698], 'Status':['No Difference in Means']}
reportcs = pd.DataFrame(reportcs)
reportcs.index = ['ComputerScience']
reportcs

,Gr1,Gr2,Gr1_Mean,Gr2_Mean,Critical_Value,P_value,Status
ComputerScience,Male,Female,31.433333,30.233333,0.05,0.698,No Difference in Means

### Final Result of this Notebook

In [22]:
report1 = pd.concat([reportmath, reportphy, reportchem, reportbio, reportcs], axis = 0)
report1

,Gr1,Gr2,Gr1_Mean,Gr2_Mean,Critical_Value,P_value,Status
Mathematics,Male,Female,32.866667,33.266667,0.05,0.600,No Difference in Means
Physics,Male,Female,33.333333,32.300000,0.05,0.228,No Difference in Means
Chemistry,Male,Female,32.600000,29.566667,0.05,0.334,No Difference in Means
Biology,Male,Female,28.466667,30.666667,0.05,0.510,No Difference in Means
ComputerScience,Male,Female,31.433333,30.233333,0.05,0.698,No Difference in Means

### Exporting the Report1

In [23]:
file_path = 'Ttest_report1.csv'
report1.to_csv(file_path, index = True)